#завдання1.перший рівень

m = float(input("Введіть кількість метрів: "))
print("Сантиметри:", m * 100)
print("Дециметри:", m * 10)
print("Міліметри:", m * 1000)
print("Милі:", m / 1609.344)

#завдання2.перший рівень

a = float(input("Введіть основу трикутника: "))
h = float(input("Введіть висоту трикутника: "))

S = a * h / 2

print("Площа трикутника:", S)

#завдання3.другий рівень

a = int(input("Введіть першу цифру: "))
b = int(input("Введіть другу цифру: "))
c = int(input("Введіть третю цифру: "))

number = a * 100 + b * 10 + c

print("Отримане число:", number)

#завдання4.другий рівень

n = int(input("Введіть чотиризначне число: "))

a = n // 1000
b = n // 100 % 10
c = n // 10 % 10
d = n % 10

print("Добуток цифр:", a * b * c * d)

#завдання5.третій рівень

n = int(input("Введіть чотиризначне число: "))

a = n // 1000
b = n // 100 % 10
c = n // 10 % 10
d = n % 10

result = d * 1000 + c * 100 + b * 10 + a

print("Перевернуте число:", result)

#завдання6.третій рівень

a = int(input("Введіть перше тризначне число: "))
b = int(input("Введіть друге тризначне число: "))

a1 = a // 100
a2 = a // 10 % 10
a3 = a % 10

b1 = b // 100
b2 = b // 10 % 10
b3 = b % 10

result = a1 * 100000 + b1 * 10000 + a2 * 1000 + b2 * 100 + a3 * 10 + b3

print("Об'єднане число:", result)